require "spec_helper"

RSpec.describe Tag::Country do
  it "has a version number" do
    expect(Tag::Country::VERSION).not_to be nil
  end

  it "should be list" do
    Tag::Country.list.equal? eql ["阿富汗", "阿尔巴尼亚", "阿尔及利亚", "安道尔", "安哥拉", "安圭拉", "安提瓜和巴布达", "阿根廷", "亚美尼亚", "阿鲁巴", "奥地利", "澳大利亚", "阿塞拜疆", "巴哈马", "巴林", "孟加拉国", "巴巴多斯", "比利时", "伯利兹", "贝宁", "不丹", "玻利维亚", "博茨瓦纳", "布韦岛", "巴西", "文莱", "波斯尼亚和黑塞哥维那", "保加利亚", "缅甸", "布隆迪", "白俄罗斯", "中非共和国", "喀麦隆", "加拿大", "乍得", "车臣共和国", "智利", "中国", "哥伦比亚", "刚果共和国", "哥斯达黎加", "克罗地亚", "古巴", "佛得角", "塞浦路斯", "捷克共和国", "丹麦", "多米尼加", "多明尼加共和国", "厄瓜多尔", "埃及", "萨尔瓦多", "赤道几内亚", "厄立特里亚", "爱沙尼亚", "埃塞俄比亚", "密克罗尼西亚", "斐济", "芬兰", "法国", "加蓬", "冈比亚", "德国", "加纳", "希腊", "格林纳达", "格鲁吉亚", "危地马拉", "几内亚比绍", "几内亚", "圭亚那", "海地", "香港", "洪都拉斯", "匈牙利", "冰岛", "科特迪瓦", "印度", "印度尼西亚", "伊朗", "伊拉克", "爱尔兰", "以色列", "意大利", "牙买加", "日本", "约旦", "柬埔寨", "哈萨克斯坦", "肯尼亚", "吉里巴斯", "吉尔吉斯斯坦", "科索沃", "科威特", "老挝", "拉脱维亚", "黎巴嫩", "莱索托", "利比里亚", "利比亚", "列支敦士登", "立陶宛", "卢森堡", "澳门", "马绍尔群岛", "马达加斯加", "马拉维", "马来西亚", "马尔代夫", "马里", "马耳他", "毛里塔尼亚", "毛里求斯", "马约特", "马其顿", "墨西哥", "黑山共和国", "摩尔多瓦", "摩纳哥", "蒙古国", "摩洛哥", "莫桑比克", "纳米比亚", "瑙鲁", "尼泊尔", "荷兰", "尼加拉瓜", "尼日利亚", "尼日尔", "朝鲜", "挪威", "新西兰", "阿曼", "巴基斯坦", "帕劳群岛", "巴勒斯坦", "巴拿马", "巴布亚新几内亚", "巴拉圭", "秘鲁", "菲律宾", "波兰", "葡萄牙", "圣多美和普林西比", "波多黎各", "卡塔尔", "罗马尼亚", "俄罗斯", "卢旺达", "沙特阿拉伯", "南非", "塞内加尔", "塞舌尔", "塞拉利昂", "新加坡", "圣基茨和尼维斯", "韩国", "圣卢西亚", "斯洛伐克", "斯洛文尼亚", "圣马力诺", "所罗门群岛", "索马里", "南苏丹", "西班牙", "斯里兰卡", "苏丹", "苏里南", "圣文森特和格林纳丁斯", "斯威士兰", "瑞典", "瑞士", "叙利亚", "塔吉克斯坦", "吉布提", "台湾", "坦桑尼亚", "第比利斯", "泰国", "东帝汶", "多哥", "汤加", "的黎波里", "特立尼达和多巴哥", "突尼斯", "土耳其", "土库曼斯坦", "北塞浦路斯土耳其共和国", "图瓦卢", "阿拉伯联合酋长国", "乌干达", "英国", "乌克兰", "布基纳法索", "乌拉圭", "美国", "乌兹别克斯坦", "瓦努阿图", "梵蒂冈城", "委内瑞拉", "越南", "萨摩亚群岛", "也门", "塞尔维亚", "刚果民主共和国", "赞比亚", "津巴布韦"]
  end

  it "should have country_tag" do
    Tag::Country.country_tag("阿富汗").is_a? Hash
  #   {"country_code"=>"AFGH", "地域标签"=>["亚洲", "中亚"], "经济标签"=>["发展中国家经济体", "OBOR"]}
    Tag::Country.country_tag("阿富汗")["country_code"].equal? eql "AFGH"
    Tag::Country.country_tag("阿富汗")["地域标签"].is_a? Array
    Tag::Country.country_tag("阿富汗")["经济标签"].is_a? Array
  end
end
